Merge pull request #23 from melvinmathew9991/sprint-9-portfolio-polish
Sprint 9 portfolio polish
